In [ ]:
#Load a CSV
import pandas as pd

df = pd.read_csv("data.csv")
df.head(10)

In [2]:
#Select speciffic columns
df[['name', 'salary', 'department']]

             name  salary   department
0     Aarav Mehta   65000  Engineering
1   Ananya Sharma   48000    Marketing
2     Rohan Patil   52000        Sales
3      Neha Verma   45000           HR
4     Aditya Nair   70000  Engineering
5    Shruti Desai   55000      Finance
6    Vikram Joshi   50000        Sales
7  Pooja Kulkarni   72000  Engineering
8       Raj Singh   60000      Finance
9   Kavita Pillai   47000    Marketing

In [3]:
#Filter rows
df[df['salary'] > 50000]

   id            name   department  salary  age gender
0   1     Aarav Mehta  Engineering   65000   28      M
2   3     Rohan Patil        Sales   52000   32      M
4   5     Aditya Nair  Engineering   70000   30      M
5   6    Shruti Desai      Finance   55000   29      F
7   8  Pooja Kulkarni  Engineering   72000   26      F
8   9       Raj Singh      Finance   60000   31      M

In [4]:
#Group by and average
df.groupby("department")["salary"].mean()

department
Engineering    69000.0
Finance        57500.0
HR             45000.0
Marketing      47500.0
Sales          51000.0
Name: salary, dtype: float64

In [5]:
#New column with calculation
df["annual_salary"] = df["salary"] * 12
df.head()

   id           name   department  salary  age gender  annual_salary
0   1    Aarav Mehta  Engineering   65000   28      M         780000
1   2  Ananya Sharma    Marketing   48000   25      F         576000
2   3    Rohan Patil        Sales   52000   32      M         624000
3   4     Neha Verma           HR   45000   27      F         540000
4   5    Aditya Nair  Engineering   70000   30      M         840000

In [7]:
#Missing Values
df.fillna({"salary": df["salary"].mean()}, inplace=True)

In [8]:
#Sort Data
df.groupby("department")["salary"].mean()

department
Engineering    69000.0
Finance        57500.0
HR             45000.0
Marketing      47500.0
Sales          51000.0
Name: salary, dtype: float64

In [9]:
#New column with calculation
df["annual_salary"] = df["salary"] * 12
df.head()

   id           name   department  salary  age gender  annual_salary
0   1    Aarav Mehta  Engineering   65000   28      M         780000
1   2  Ananya Sharma    Marketing   48000   25      F         576000
2   3    Rohan Patil        Sales   52000   32      M         624000
3   4     Neha Verma           HR   45000   27      F         540000
4   5    Aditya Nair  Engineering   70000   30      M         840000

In [10]:
#Sort employees by salary
df.sort_values("salary", ascending=False)

   id            name   department  salary  age gender  annual_salary
7   8  Pooja Kulkarni  Engineering   72000   26      F         864000
4   5     Aditya Nair  Engineering   70000   30      M         840000
0   1     Aarav Mehta  Engineering   65000   28      M         780000
8   9       Raj Singh      Finance   60000   31      M         720000
5   6    Shruti Desai      Finance   55000   29      F         660000
2   3     Rohan Patil        Sales   52000   32      M         624000
6   7    Vikram Joshi        Sales   50000   35      M         600000
1   2   Ananya Sharma    Marketing   48000   25      F         576000
9  10   Kavita Pillai    Marketing   47000   24      F         564000
3   4      Neha Verma           HR   45000   27      F         540000

In [11]:
df.fillna({"salary": df["salary"].mean()}, inplace=True)

------------------Slicing----------------------

In [12]:
import pandas as pd

player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])
print(df)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [13]:
df1 = df.iloc[0:2]
print(df1)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000

In [14]:
df1 = df.iloc[:,0:2]
print(df1)

            Name  Age
0      M.S.Dhoni   36
1  A.B.D Villers   38
2        V.Kohli   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

In [15]:
value = df.iloc[2,3]
print(value)

8428000

In [16]:
data = df[df['Age']>35]
print(data)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [17]:
data = df[df['Age']>35].iloc[:,:]
print(data)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [18]:
df.set_index('Name',inplace=True)

In [20]:
custom = df.loc['A.B.D Villers':'S.Smith']
print(custom)

               Age  Weight   Salary
Name
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000

--------Filter Pandas Dataframe with multiple conditions----------

In [22]:
# import module
import pandas as pd

# assign data
df = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

# display dataframe
display(df)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [23]:
display(df.loc[(df['Salary']>=100000) & (df['Age']< 40) & (df['JOB'].str.startswith('D')),
                    ['Name','JOB']])

        Name       JOB
0   RACHEL    DESIGNER

In [25]:
# filter dataframe
import numpy as np
filtered_values = np.where((df['Salary']>=100000) & (df['Age']< 40) & (df['JOB'].str.startswith('D')))

In [26]:
print(filtered_values)

(array([0]),)

In [27]:
display(df.loc[filtered_values])

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

In [28]:
display(dataFrame.query('Salary  <= 100000 & Age < 40 & JOB.str.startswith("C").values'))

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

In [29]:
# filter dataframe 
display(dataFrame[(dataFrame['Salary']>=100000) & (dataFrame['Age']<40) & dataFrame['JOB'].str.startswith('P')][['Name','Age','Salary']])

         Name  Age  Salary
3    ROSS       33  120000

In [30]:
# filter dataframe 
display(dataFrame[dataFrame.eval("Salary <=100000 & (Age <40) & JOB.str.startswith('A').values")])

        Name  Age  Salary     JOB
5   JOEY       30   95000  ARTIST

In [ ]:
-----Merging, Joining and Concatenating------

In [31]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

In [32]:
data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}

In [33]:
df = pd.DataFrame(data1, index=[0, 1, 2, 3])

In [34]:
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

In [35]:
print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [36]:
frames = [df, df1]

In [37]:
res1 = pd.concat(frames)

In [45]:
res1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [39]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

In [40]:
data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

In [41]:
df = pd.DataFrame(data1, index=[0, 1, 2, 3])

In [42]:
df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])

In [43]:
print(df, "\n\n", df1)

     Name  Age    Address Qualification  Mobile No
0     Jai   27     Nagpur           Msc         97
1  Princi   24     Kanpur            MA         91
2  Gaurav   22  Allahabad           MCA         58
3    Anuj   32    Kannuaj           Phd         76

      Name  Age    Address Qualification  Salary
2  Gaurav   22  Allahabad           MCA    1000
3    Anuj   32    Kannuaj           Phd    2000
6  Dhiraj   12  Allahabad          Bcom    3000
7  Hitesh   52    Kannuaj        B.hons    4000

In [44]:
res2 = pd.concat([df, df1], axis=1, join='inner')

res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Gaurav,22,Allahabad,MCA,58,Gaurav,22,Allahabad,MCA,1000
3,Anuj,32,Kannuaj,Phd,76,Anuj,32,Kannuaj,Phd,2000

In [46]:
res = pd.concat([df, df1], ignore_index=True)
 
res

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
4  Gaurav   22  Allahabad           MCA        NaN  1000.0
5    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [47]:
import pandas as pd

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
        'Age':[17, 14, 12, 52],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1,index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [48]:
frames = [df, df1 ]

res = pd.concat(frames, keys=['x', 'y'])
res

       Name  Age    Address Qualification
x 0     Jai   27     Nagpur           Msc
  1  Princi   24     Kanpur            MA
  2  Gaurav   22  Allahabad           MCA
  3    Anuj   32    Kannuaj           Phd
y 4    Abhi   17     Nagpur         Btech
  5  Ayushi   14     Kanpur           B.A
  6  Dhiraj   12  Allahabad          Bcom
  7  Hitesh   52    Kannuaj        B.hons

In [49]:
import pandas as pd

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data1,index=[0, 1, 2, 3])

s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')

print(df, "\n\n", s1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

In [50]:
res = pd.concat([df, s1], axis=1)

res

     Name  Age    Address Qualification  Salary
0     Jai   27     Nagpur           Msc    1000
1  Princi   24     Kanpur            MA    2000
2  Gaurav   22  Allahabad           MCA    3000
3    Anuj   32    Kannuaj           Phd    4000